{
  "name": "Epic 11: Trip Report",
  "branchName": "ralph/epic-11-trip-report",
  "description": "Post-trip summary with task completion, proof photos, and vault access log.",
  "userStories": [
    {
      "id": "US-076",
      "title": "Trip report data aggregation",
      "description": "As a developer, I need a query that aggregates all trip data into a report structure.",
      "acceptanceCriteria": [
        "Query accepts tripId, returns: trip dates, sitter names, all tasks with completion status, proof photos, vault access log, activity timeline",
        "Tasks marked: done (with timestamp), not done, or skipped",
        "Report available after trip status is 'expired' or 'completed'",
        "Also available during active trip (live progress view)",
        "pnpm typecheck passes",
        "pnpm lint passes",
        "pnpm build passes"
      ],
      "priority": 1,
      "passes": false,
      "notes": "Load /convex-best-practices to write getTripReport query in convex/reports.ts. It accepts tripId and returns a structured object: { trip: { startDate, endDate, status, sitters[] }, tasks: [{ id, text, section, timeSlot, completions: [{ sitterName, completedAt, proofPhotoUrl }] }], overlayItems: [{ text, date, completions[] }], vaultAccessLog: [{ sitterName, itemLabel, accessedAt }], activityTimeline: ActivityLog[] }. Merge recurring instructions and overlay items into a unified task list, cross-referencing TaskCompletions by taskRef. A task with zero completions for a given day is 'not done'; completions with a timestamp are 'done'. Mark a task 'skipped' if it had no completions and the trip is expired. Verify the query is callable during active trips (live progress) and returns the same structure — just with fewer completions and status='active'.",
      "dependsOn": ["US-040", "US-068"]
    },
    {
      "id": "US-077",
      "title": "Trip report in-app view",
      "description": "As an owner, I want to view a scrollable trip report so I can review everything that happened.",
      "acceptanceCriteria": [
        "Trip report page accessible from trip detail or dashboard (completed trips)",
        "Sections: summary (dates, sitter), task completion list (done/not done with timestamps), proof photos (gallery), vault access log, full activity timeline",
        "Proof photos tappable to full-size",
        "Color-coded completion: green (done), red (not done)",
        "Visual matches design system card styles",
        "pnpm typecheck passes",
        "pnpm lint passes",
        "pnpm build passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": false,
      "notes": "Load /convex-best-practices to wire useQuery(api.reports.getTripReport, { tripId }) in the report page, which works for both active and completed trips. Load /nextjs-best-practices to set up src/app/dashboard/trips/[tripId]/report/page.tsx within CreatorLayout, linked from the trip detail card on the dashboard. Load /tailwind-design-system to structure the scrollable report: (1) Summary card — bg-bg-raised rounded-xl shadow-sm with trip dates, sitter names, and overall X/Y tasks done count; (2) Task completion list — each task as a rounded-lg card with a secondary/success dot (bg-secondary-light text-secondary) for done and danger dot (bg-danger-light text-danger) for not done, completion timestamp in text-text-muted; (3) Proof photos — a 2-column grid of 120px rounded-md thumbnails tappable to the full-screen viewer from US-039; (4) Vault access log — bg-vault-subtle rounded-lg list rows with sitter name, item label, and timestamp; (5) Activity timeline using ActivityFeedItem components (US-018). Use /dev-browser to verify: done tasks show green indicator with timestamp, not-done tasks show red indicator, proof photos open full-screen on tap, the vault log section shows the correct access events.",
      "dependsOn": ["US-076", "US-018"]
    },
    {
      "id": "US-078",
      "title": "Trip report PDF export",
      "description": "As an owner, I want to download the trip report as a PDF so I can share it with co-owners or keep for records.",
      "acceptanceCriteria": [
        "'Download PDF' button on trip report page",
        "PDF includes: all report sections, proof photos (embedded), timestamps",
        "PDF styled cleanly (doesn't need to match app design exactly, but branded with Handoff logo)",
        "Reasonable file size (compressed images)",
        "pnpm typecheck passes",
        "pnpm lint passes",
        "pnpm build passes"
      ],
      "priority": 3,
      "passes": false,
      "notes": "Load /convex-best-practices to write a generateTripReportPdf Convex action (convex/reportActions.ts, 'use node') that calls getTripReport internally, uses the @react-pdf/renderer or puppeteer npm package to generate a PDF, and returns the PDF as a base64 string or uploads it to Convex file storage and returns a download URL. Use @react-pdf/renderer if adding a new dependency, as it works in Node.js without a browser runtime. The PDF should include: a Handoff wordmark header, trip summary section, task list with ✓/✗ symbols and timestamps, proof photos scaled to fit (compress to max 800px wide using sharp or canvas before embedding), and vault access log. The 'Download PDF' button in the trip report page calls this action, shows a loading spinner while generating, then triggers a browser download via an <a href='[dataUrl]' download='trip-report.pdf'> click.",
      "dependsOn": ["US-077"]
    },
    {
      "id": "US-079",
      "title": "Trip report shareable link",
      "description": "As an owner, I want to share the trip report via a link so co-owners or insurance can view it.",
      "acceptanceCriteria": [
        "'Share Report' button generates a unique read-only link",
        "Link shows the report without requiring login",
        "Link can be revoked by owner",
        "Report link is separate from the trip Handoff link",
        "pnpm typecheck passes",
        "pnpm lint passes",
        "pnpm build passes"
      ],
      "priority": 4,
      "passes": false,
      "notes": "Load /convex-best-practices to add a reportShareLink field to the Trips table and implement a generateReportLink mutation (separate from the trip shareLink) that creates a new random slug stored as Trips.reportShareLink. Write a getTripReportByShareLink public query (no auth required) that looks up by reportShareLink and returns the same data as getTripReport — this is deliberately public since it's a static audit report the owner chose to share. Write revokeReportLink mutation that nullifies Trips.reportShareLink. Load /nextjs-best-practices to set up src/app/report/[reportShareLink]/page.tsx as a public page (no auth check) that renders the trip report UI from US-077 in read-only mode without the CreatorLayout sidebar. Load /tailwind-design-system to add a 'Share Report' button on the trip report page (btn-primary) that calls generateReportLink, shows the link in a copy-able Input, and a 'Revoke link' text button (text-danger) to remove access.",
      "dependsOn": ["US-077"]
    }
  ]
}
