{
  "name": "Epic 6: Secure Vault",
  "description": "Encrypted credential storage, SMS PIN verification, access logging, auto-expiration.",
  "branchName": "ralph/epic-06-vault",
  "userStories": [
    {
      "id": "US-048",
      "title": "Vault data model and encryption",
      "description": "As a developer, I need vault items stored with encryption at rest so sensitive credentials are protected.",
      "acceptanceCriteria": [
        "VaultItems table: id, propertyId, label, encryptedValue, instructions, locationCardId, itemType (door/alarm/wifi/gate/garage/safe/custom)",
        "Values encrypted before storage (server-side encryption via Convex action)",
        "Decryption only on authorized access (phone-verified sitter during active trip)",
        "Encryption key management strategy documented",
        "pnpm typecheck passes",
        "pnpm lint passes",
        "pnpm build passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Security-sensitive story — verify access control thoroughly. Load /convex-best-practices to define the VaultItems table in convex/schema.ts with encryptedValue as v.string() (stores AES-256-GCM ciphertext + IV as a base64 JSON string), itemType as v.union of 7 literals, and an internalMutation for decryption that is only callable from internal Convex functions (not public API). Implement encryption/decryption in a Convex action (convex/vaultActions.ts, 'use node') using Node.js crypto.subtle AES-256-GCM with a VAULT_ENCRYPTION_KEY env var. Document the key strategy: one symmetric key per deployment stored as a Convex env var — document rotation procedure in a code comment. Write a createVaultItem action that encrypts the value before calling the internal mutation, and a getDecryptedVaultItem action that verifies trip-active + sitter-phone-verified before decrypting.",
      "dependsOn": [
        "US-002"
      ],
      "completionNotes": "Completed by agent"
    },
    {
      "id": "US-049",
      "title": "Create and manage vault items",
      "description": "As a creator, I want to add, edit, and delete vault items so I can store and update my sensitive codes.",
      "acceptanceCriteria": [
        "Create: select type -> enter label, value (masked input with reveal toggle), instructions, optional location card",
        "Edit: update any field, re-encrypt on value change",
        "Delete: with confirmation dialog",
        "List view on dashboard showing labels (values always masked for creator too until reveal)",
        "Accessible from wizard step 3 and from dashboard -> My Property",
        "pnpm typecheck passes",
        "pnpm lint passes",
        "pnpm build passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Load /convex-best-practices to wire the createVaultItem and updateVaultItem actions from US-048 (re-encrypt on value change by calling the action again), and deleteVaultItem mutation. Use useQuery(api.vault.getVaultItemLabels) to show labels-only list (never returns encryptedValue to the client). Load /tailwind-design-system to reuse the VaultItem component from src/components/ui: vault color tokens (bg-vault, text-vault, border-vault), monospace font for the masked value (font-mono), an eye icon toggle using text-text-muted for reveal/hide, and a copy-to-clipboard button. Load /frontend-design to build the vault item form: type selector icon grid (door, alarm, WiFi, gate, garage, safe, custom) that pre-fills the label, a type=password input for value with show/hide toggle, instructions textarea, and optional location card attach. Render delete as an inline confirmation within the vault item card (bg-danger-light text-danger). Use /dev-browser to verify: the value field masks input, reveal toggle shows/hides value, saved items show only the label in the list (not the value), delete requires confirmation.",
      "dependsOn": [
        "US-048",
        "US-010"
      ],
      "completionNotes": "Completed by agent"
    },
    {
      "id": "US-050",
      "title": "SMS PIN verification flow",
      "description": "As a sitter, I want to verify my phone number via SMS PIN so I can access vault items securely.",
      "acceptanceCriteria": [
        "Sitter taps vault tab or vault item -> sees 'Verify your phone number to view' message",
        "System sends 6-digit PIN via SMS to the phone number the owner registered for this sitter",
        "Sitter enters PIN -> validated against stored PIN",
        "PIN expires after 10 minutes",
        "Max 3 attempts per PIN; new PIN required after 3 failures",
        "On success: vault items revealed for this session",
        "One verification per session (not per item)",
        "SMS delivery via Twilio or similar (Convex action)",
        "pnpm typecheck passes",
        "pnpm lint passes",
        "pnpm build passes",
        "Verify in browser using dev-browser skill",
        "Access control verification — unauthorized users cannot access restricted data"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Security-sensitive: verify PIN expiration and attempt limiting. Load /convex-best-practices to implement the PIN flow: create a VaultPins table (tripId, sitterPhone, hashedPin, expiresAt, attemptCount) with an internal mutation for creation and validation. Write a sendSmsPin Convex action (convex/vaultActions.ts, 'use node') that generates a 6-digit random PIN, hashes it with SHA-256 + salt, stores in VaultPins with expiresAt = now + 10min, and sends via Twilio SMS using TWILIO_ACCOUNT_SID + TWILIO_AUTH_TOKEN + TWILIO_PHONE_NUMBER env vars. Write a verifyPin action that checks: PIN not expired, attemptCount < 3, hash matches — increment attemptCount on failure, delete record on success. Store verification status in a short-lived Convex session record or signed cookie. Load /frontend-design to build the PIN entry UI: a 6-digit OTP input (6 separate single-digit inputs that auto-advance focus), a 'Send PIN' button, attempt counter ('2 attempts remaining'), and a 'Resend PIN' link after first send. Load /tailwind-design-system to render the verification gate using bg-bg-raised rounded-xl shadow-md, vault color for the lock icon, and danger-light for attempt limit errors. Use /dev-browser to verify: tapping vault tab shows the verification gate, SMS sends (check Twilio logs), entering a wrong PIN shows remaining attempts, 3 wrong attempts requires a new PIN, correct PIN reveals vault items for the session.",
      "dependsOn": [
        "US-043",
        "US-048"
      ],
      "completionNotes": "Completed by agent"
    },
    {
      "id": "US-051",
      "title": "Vault access for verified sitters",
      "description": "As a verified sitter, I want to see decrypted vault items so I can access door codes, WiFi, and alarm codes.",
      "acceptanceCriteria": [
        "After PIN verification, vault items display with Vault Item component (revealed state)",
        "Monospace code display, copy-to-clipboard button",
        "Instructions text and location card visible with the code",
        "If trip is not active (before start or after end), vault returns 'This handoff is not currently active'",
        "If sitter phone not registered for this trip, vault returns 'You don't have access to secure items'",
        "pnpm typecheck passes",
        "pnpm lint passes",
        "pnpm build passes",
        "Verify in browser using dev-browser skill",
        "Access control verification — unauthorized users cannot access restricted data"
      ],
      "priority": 4,
      "passes": true,
      "notes": "Load /convex-best-practices to implement the getDecryptedVaultItems action with a three-layer access check: (1) trip status === 'active', (2) sitter phone exists in Sitters table for this trip with vaultAccess === true, (3) PIN verification session is valid. If any check fails, return a typed error enum (TRIP_INACTIVE, NOT_REGISTERED, NOT_VERIFIED) — never throw generic errors that leak information. Call the logVaultAccess mutation after each successful item view. Load /tailwind-design-system to render the vault page using the VaultItem component in revealed state: monospace font (font-mono) for the code value, bg-vault text-on-vault for the code block, a copy-to-clipboard button using the Clipboard icon, instructions text below in font-body text-text-secondary, and the inline LocationCard if present. Show the correct access-denied empty states ('This handoff is not currently active', 'You don't have access to secure items') using bg-bg-raised rounded-xl p-8 text-center with vault lock icon. Use /dev-browser to verify: a verified sitter sees decrypted codes in monospace, copy-to-clipboard works, the location card renders with the code, an unverified sitter sees the gate message, and accessing with an expired trip shows the inactive message.",
      "dependsOn": [
        "US-050",
        "US-010"
      ],
      "completionNotes": "Completed by agent"
    },
    {
      "id": "US-052",
      "title": "Vault access logging",
      "description": "As a system, I need to log every vault access event so the owner has a complete audit trail.",
      "acceptanceCriteria": [
        "VaultAccessLog table: id, tripId, vaultItemId, sitterPhone, sitterName, accessedAt, verified (boolean)",
        "Log entry created when sitter views a decrypted vault item",
        "Log entry includes which specific item was accessed",
        "Failed verification attempts also logged (verified: false)",
        "pnpm typecheck passes",
        "pnpm lint passes",
        "pnpm build passes",
        "Audit logging — confirm access events are logged with correct timestamps"
      ],
      "priority": 5,
      "passes": true,
      "notes": "Load /convex-best-practices to define the VaultAccessLog table in convex/schema.ts with an index on tripId+accessedAt for the owner audit view. Write an internal logVaultAccess mutation that is called from: (1) the getDecryptedVaultItems action on each successful decryption (verified: true), (2) the verifyPin action on each failed attempt (verified: false, vaultItemId: null). Make logVaultAccess an internalMutation so it cannot be called directly from the client. Confirm the accessedAt field uses Date.now() server-side (not client-provided) to prevent timestamp spoofing. Write a getVaultAccessLog query restricted to the property owner (verify ctx.auth userId matches property ownerId) for the trip report and activity feed.",
      "dependsOn": [
        "US-050"
      ],
      "completionNotes": "Completed by agent"
    },
    {
      "id": "US-053",
      "title": "Owner notification on vault access",
      "description": "As an owner, I want to be notified immediately when someone accesses a vault item so I have peace of mind.",
      "acceptanceCriteria": [
        "Push notification: '[Sitter name] accessed your [item label] at [time]'",
        "Notification links to activity feed",
        "Activity feed shows vault access events with slate dot",
        "pnpm typecheck passes",
        "pnpm lint passes",
        "pnpm build passes"
      ],
      "priority": 6,
      "passes": true,
      "notes": "Depends on notification infrastructure from Epic 10. Load /convex-best-practices to extend the logVaultAccess internalMutation (US-052) to also call sendPushNotification (from US-070) with the message '[sitterName] accessed your [itemLabel] at [time]' and logActivityEvent to create an ActivityLog entry with eventType='vault_accessed' and metadata including vaultItemId and sitterName. The activity feed event should use the slate color dot (bg-vault/text-vault per design system) matching the 'vault_accessed' event type defined in US-069. The push notification payload should include a deep-link URL to the trip activity feed page.",
      "dependsOn": [
        "US-052",
        "US-070"
      ],
      "completionNotes": "Completed by agent"
    },
    {
      "id": "US-054",
      "title": "Vault auto-expiration on trip end",
      "description": "As a system, I need vault access to automatically expire when the trip ends so codes aren't accessible indefinitely.",
      "acceptanceCriteria": [
        "Vault queries check trip status — only return items if trip is 'active'",
        "When trip expires (US-045), subsequent vault access attempts show 'This trip has ended'",
        "No action required by owner — automatic",
        "pnpm typecheck passes",
        "pnpm lint passes",
        "pnpm build passes",
        "Expiration logic — confirm time-bound access auto-expires correctly"
      ],
      "priority": 7,
      "passes": false,
      "notes": "Load /convex-best-practices to implement expiration as a query-level guard rather than a delete: the getDecryptedVaultItems action (US-051) already checks trip.status === 'active' as step 1 of its access control — verify this check catches expiration immediately after the cron runs (US-045). Also add an inline expiration check: if trip.endDate < Date.now() and status is still 'active', call expireTrip mutation lazily before returning the error. This ensures expiration works even if the daily cron hasn't run yet. Test the expiration boundary: a trip expiring at midnight should deny access at 12:01 AM and show 'This trip has ended' (TRIP_INACTIVE error enum from US-051).",
      "dependsOn": [
        "US-045",
        "US-048"
      ]
    },
    {
      "id": "US-055",
      "title": "One-click vault access revocation",
      "description": "As an owner, I want to instantly revoke vault access for a sitter so I can respond to security concerns.",
      "acceptanceCriteria": [
        "'Revoke Access' button per sitter on trip management page",
        "Confirmation dialog: 'Revoke vault access for [name]?'",
        "On confirm: sitter's vaultAccess set to false immediately",
        "Sitter sees 'Your access has been revoked' on next vault attempt",
        "Owner receives confirmation toast",
        "pnpm typecheck passes",
        "pnpm lint passes",
        "pnpm build passes",
        "Verify in browser using dev-browser skill",
        "Access control verification — revoked users cannot access vault"
      ],
      "priority": 8,
      "passes": false,
      "notes": "Load /convex-best-practices to implement the revokeSitterVaultAccess mutation that sets Sitters.vaultAccess = false for the given sitterId and immediately invalidates any active VaultPins for this sitter (delete from VaultPins table). Verify the mutation checks that the caller is the property owner (ctx.auth userId === property.ownerId) before allowing revocation. The getDecryptedVaultItems access check (US-051) already reads vaultAccess at query time, so revocation takes effect on the next vault request without any caching concern. Load /tailwind-design-system to render the revoke button on the trip management page as a small btn-danger (or outlined danger variant) next to each sitter entry, with an inline confirmation using bg-danger-light text-danger rounded-lg before firing the mutation. Show a toast (success variant, bg-secondary-light) on successful revocation. Use /dev-browser to verify: clicking Revoke shows confirmation, confirming sets vaultAccess=false, the sitter's vault attempt immediately shows 'Your access has been revoked', and the owner sees a success toast.",
      "dependsOn": [
        "US-043",
        "US-004"
      ]
    },
    {
      "id": "US-056",
      "title": "Vault hidden state for unregistered viewers",
      "description": "As a sitter without vault access, I should not see any vault content — not even blurred — so there's no false sense of access.",
      "acceptanceCriteria": [
        "If sitter phone not registered for trip: vault tab shows 'Sarah shared secure info with you — verify your phone number to view'",
        "No blurred codes, no item labels, no teaser content",
        "If link is forwarded to someone not registered: same message, no vault content",
        "Vault tab badge shows lock icon to indicate content exists",
        "pnpm typecheck passes",
        "pnpm lint passes",
        "pnpm build passes",
        "Verify in browser using dev-browser skill",
        "Access control verification — unregistered viewers see zero vault data"
      ],
      "priority": 9,
      "passes": false,
      "notes": "Load /convex-best-practices to ensure the vault queries return zero data (not even item count or labels) for unregistered phones — the getVaultForSitter query should check sitter registration first and return { status: 'NOT_REGISTERED' } before touching the VaultItems table. Never return item labels or counts to unregistered users. Load /tailwind-design-system to render the not-registered empty state: a centered vault lock icon in text-vault, the message '[Owner name] shared secure info with you — verify your phone number to view' in font-body text-text-primary, a 'Verify Phone Number' CTA button (btn-primary) that triggers the SMS PIN flow (US-050), all within a bg-bg-raised rounded-xl p-8 container. The Vault tab in the bottom nav should show a lock badge icon (not a count) regardless of registration status to indicate content exists without revealing how much. Use /dev-browser to verify: accessing the vault tab with an unregistered phone shows only the lock message and CTA with no item labels or blurred content, the vault tab badge shows a lock icon, and a registered-but-unverified sitter sees the PIN prompt instead.",
      "dependsOn": [
        "US-010",
        "US-050"
      ]
    }
  ],
  "metadata": {
    "updatedAt": "2026-02-20T01:15:52.138Z"
  }
}