{
  "name": "Epic 2: Creator Authentication",
  "description": "Signup, login, OAuth, session management. Required before any creator features.",
  "branchName": "ralph/epic-02-auth",
  "userStories": [
    {
      "id": "US-021",
      "title": "Creator signup with email and password",
      "description": "As a new user, I want to create an account with email and password so I can start building my Handoff.",
      "acceptanceCriteria": [
        "Signup form: email, password, confirm password",
        "Password validation: minimum 8 characters",
        "Email uniqueness check with clear error message",
        "On success: redirect to wizard (US-028)",
        "Convex auth integration configured",
        "Form matches design system (inputs, buttons, error states)",
        "pnpm typecheck passes",
        "pnpm lint passes",
        "pnpm build passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Load /convex to configure Convex auth and write the signup mutation (email uniqueness check, password validation). Load /convex-best-practices for validator patterns and error handling. Load /nextjs-best-practices for App Router redirect to wizard on success and post-auth route protection. Load /tailwind-css-patterns for signup form layout and error state styling. Load /tailwind-design-system to ensure Input/Button match design tokens (border, radius, focus ring). Use /dev-browser to verify the full signup flow, test duplicate email error, and confirm redirect to wizard.",
      "dependsOn": [
        "US-002",
        "US-004",
        "US-005"
      ]
    },
    {
      "id": "US-022",
      "title": "Creator login",
      "description": "As a returning user, I want to log in with my email and password so I can access my dashboard.",
      "acceptanceCriteria": [
        "Login form: email, password",
        "Invalid credentials show clear error message",
        "On success: redirect to creator dashboard",
        "'Forgot password' link (can be placeholder for v1)",
        "Session persists across browser refreshes",
        "pnpm typecheck passes",
        "pnpm lint passes",
        "pnpm build passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Load /convex for the login mutation, signIn action, and useQuery session state. Load /convex-best-practices for session persistence patterns and error propagation from auth failures. Load /nextjs-best-practices for App Router redirect to dashboard on success, middleware session guard, and the forgot-password placeholder route. Load /tailwind-css-patterns for login form layout and invalid credentials error state styling. Use /dev-browser to verify the login flow, test the wrong-password error message, and confirm session survives a browser refresh.",
      "dependsOn": [
        "US-021"
      ]
    },
    {
      "id": "US-023",
      "title": "OAuth login (Google, Apple)",
      "description": "As a user, I want to sign up or log in with Google or Apple so I can get started without creating a password.",
      "acceptanceCriteria": [
        "Google OAuth button on signup and login pages",
        "Apple OAuth button on signup and login pages",
        "New OAuth user creates account automatically",
        "Returning OAuth user logs in seamlessly",
        "OAuth accounts linked to same email merge correctly",
        "pnpm typecheck passes",
        "pnpm lint passes",
        "pnpm build passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Load /convex to configure Google and Apple OAuth providers in Convex auth and handle the OAuth callback with identity linking. Load /convex-best-practices for account merging strategy when the same email exists across providers. Load /frontend-design to build the OAuth buttons following provider brand guidelines (Google colors + logo, Apple black button). Load /nextjs-best-practices for OAuth redirect and callback route handling in App Router. Use /dev-browser to verify both OAuth flows, test new vs returning user paths, and confirm same-email account merging.",
      "dependsOn": [
        "US-021"
      ],
      "completionNotes": "Completed by agent"
    },
    {
      "id": "US-024",
      "title": "Creator dashboard shell",
      "description": "As a logged-in creator, I want to see my dashboard with my property, active trip status, and recent activity so I have a home base.",
      "acceptanceCriteria": [
        "Dashboard shows: property summary card, active trip status (or 'Create your first trip' CTA), recent activity preview",
        "Navigation to: My Property (edit manual), Trips, Settings",
        "Empty state for new users with no property: 'Let's set up your home' CTA leading to wizard",
        "Responsive at all breakpoints",
        "Logout option accessible from settings/menu",
        "pnpm typecheck passes",
        "pnpm lint passes",
        "pnpm build passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 4,
      "passes": true,
      "notes": "Load /frontend-design to build the dashboard layout — property summary card, active trip status, recent activity preview, and empty states with the 'Let's set up your home' CTA. Load /tailwind-css-patterns for the responsive grid at mobile/tablet/desktop breakpoints and navigation structure. Load /tailwind-design-system to apply design tokens consistently across card/section components (shadow, radius, color tokens). Load /nextjs-react-typescript for TypeScript interfaces for dashboard data, App Router layout with CreatorLayout, and session-based routing guard. Load /convex for useQuery hooks fetching property/trip/activity data and the signOut mutation for logout. Use /dev-browser to verify the dashboard at all breakpoints, test the empty state for new users with no property, and confirm the logout flow from the settings menu.",
      "dependsOn": [
        "US-020",
        "US-021"
      ],
      "completionNotes": "Completed by agent"
    }
  ],
  "metadata": {
    "updatedAt": "2026-02-19T00:21:58.389Z"
  }
}