{
  "name": "Epic 12: Offline & PWA",
  "branchName": "ralph/epic-12-offline-pwa",
  "description": "Service worker caching, offline task completion, and sync.",
  "userStories": [
    {
      "id": "US-080",
      "title": "Service worker caching for instructions and photos",
      "description": "As a sitter, I want the Handoff to work offline after my first visit so I can access instructions without cell service.",
      "acceptanceCriteria": [
        "Service worker caches: app shell, all instruction text, pet profiles, location card photos, emergency contacts",
        "After first load, all cached content available offline",
        "Video files: cache on explicit play (not pre-cached due to size)",
        "Cache invalidated when owner updates the manual (version check on reconnect)",
        "pnpm typecheck passes",
        "pnpm lint passes",
        "pnpm build passes"
      ],
      "priority": 1,
      "passes": false,
      "notes": "",
      "dependsOn": ["US-019", "US-025"]
    },
    {
      "id": "US-081",
      "title": "Offline task check-off with sync",
      "description": "As a sitter, I want to check off tasks while offline and have them sync when I'm back online.",
      "acceptanceCriteria": [
        "Task check-offs stored in IndexedDB or local storage when offline",
        "Visual indicator: 'offline — will sync when connected' subtle badge",
        "On reconnect: queued completions sent to Convex with original timestamps",
        "No duplicate completions on sync",
        "Owner sees accurate timestamps (when task was actually checked, not when synced)",
        "pnpm typecheck passes",
        "pnpm lint passes",
        "pnpm build passes"
      ],
      "priority": 2,
      "passes": false,
      "notes": "",
      "dependsOn": ["US-060", "US-019"]
    },
    {
      "id": "US-082",
      "title": "Offline photo proof queue",
      "description": "As a sitter, I want to upload proof photos while offline and have them sync later.",
      "acceptanceCriteria": [
        "Photos stored locally when offline (IndexedDB blob storage)",
        "Upload queue indicator: '2 photos waiting to upload'",
        "On reconnect: photos uploaded in order with original timestamps",
        "Failed uploads retry automatically (3 attempts with backoff)",
        "Queue persists across app closes/reopens",
        "pnpm typecheck passes",
        "pnpm lint passes",
        "pnpm build passes"
      ],
      "priority": 3,
      "passes": false,
      "notes": "",
      "dependsOn": ["US-061", "US-019"]
    },
    {
      "id": "US-083",
      "title": "Vault stays online-only",
      "description": "As a system, vault items must never be cached offline so credentials aren't stored on the device.",
      "acceptanceCriteria": [
        "Vault API responses include Cache-Control: no-store",
        "Service worker explicitly excludes vault endpoints from caching",
        "Vault tab shows 'Connect to the internet to access secure items' when offline",
        "No vault data in IndexedDB, local storage, or service worker cache",
        "pnpm typecheck passes",
        "pnpm lint passes",
        "pnpm build passes",
        "Access control verification — no vault data persists on device"
      ],
      "priority": 4,
      "passes": false,
      "notes": "Security-critical: verify no vault data leaks into any cache",
      "dependsOn": ["US-019", "US-048"]
    }
  ]
}
