{
  "name": "Epic 7: Emergency Contacts",
  "description": "Contact management and tap-to-call for sitters.",
  "branchName": "ralph/epic-07-contacts",
  "userStories": [
    {
      "id": "US-057",
      "title": "Emergency contact data model",
      "description": "As a developer, I need the EmergencyContacts schema in Convex.",
      "acceptanceCriteria": [
        "EmergencyContacts table: id, propertyId, name, role, phone, notes, sortOrder",
        "Queries: get contacts by propertyId, ordered by sortOrder",
        "Mutations: create, update, delete, reorder",
        "Pre-seed: ASPCA Poison Control (888-426-4435) as default",
        "pnpm typecheck passes",
        "pnpm lint passes",
        "pnpm build passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Load /convex-best-practices to define the EmergencyContacts table in convex/schema.ts with role as v.union of v.literal('owner'), v.literal('partner'), v.literal('veterinarian'), v.literal('neighbor'), v.literal('emergency'), v.literal('custom'), an isLocked boolean for the ASPCA pre-seed slot, and an index on propertyId+sortOrder. Write getContactsByPropertyId query that returns contacts ordered by sortOrder. Write createContact, updateContact, deleteContact (blocked if isLocked=true), and reorderContacts (accepts [{id, sortOrder}] array for batch update) mutations in convex/contacts.ts. Add a createDefaultContacts internalMutation called during property creation to seed the ASPCA Poison Control contact (isLocked: true, sortOrder: 0).",
      "dependsOn": [
        "US-002"
      ],
      "completionNotes": "Completed by agent"
    },
    {
      "id": "US-058",
      "title": "Add and manage emergency contacts",
      "description": "As a creator, I want to add, edit, reorder, and delete emergency contacts.",
      "acceptanceCriteria": [
        "Add contact form: name, role (dropdown: Owner, Partner, Veterinarian, Neighbor, Emergency, Custom), phone, notes",
        "Edit any contact inline",
        "Delete with confirmation",
        "Drag to reorder",
        "Poison control pre-filled and non-deletable (but editable)",
        "Accessible from wizard step 4 and dashboard -> My Property",
        "pnpm typecheck passes",
        "pnpm lint passes",
        "pnpm build passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": false,
      "notes": "Load /convex-best-practices to wire useMutation(api.contacts.create/update/delete/reorder) and useQuery(api.contacts.getByPropertyId) with propertyId from context. Load /frontend-design to build the contacts management UI: a list of existing contacts as inline-editable cards (click to expand form fields), an 'Add contact' button that appends a blank card, a role dropdown using the 6 predefined roles, up/down arrow buttons for manual reorder (calling reorderContacts), and delete button hidden on the isLocked ASPCA card. Load /tailwind-design-system to style each contact card using bg-bg-raised rounded-lg border-border-default, a role color-coded icon (owner=primary, vet=secondary, emergency=danger, etc.) in a rounded-round 32px avatar, the phone as font-body text-secondary (matching the tap-to-call style from US-059), and a lock icon badge on the ASPCA card. Show delete confirmation inline within the card using bg-danger-light. Use /dev-browser to verify: ASPCA contact is present by default and cannot be deleted (no delete button), adding a new contact saves inline, role dropdown shows all 6 options, arrows reorder and persist on reload.",
      "dependsOn": [
        "US-057",
        "US-005"
      ]
    },
    {
      "id": "US-059",
      "title": "Emergency contact display (sitter view)",
      "description": "As a sitter, I want to see emergency contacts with tap-to-call so I can reach the right person instantly.",
      "acceptanceCriteria": [
        "Emergency Contact Bar rendered on Today View and accessible from every screen",
        "Tap contact -> initiates phone call (tel: link)",
        "Contacts ordered by creator's sort order",
        "Color-coded icons by role per design system",
        "Accessible via 'Contacts' tab in bottom navigation as a full-page view with notes visible",
        "pnpm typecheck passes",
        "pnpm lint passes",
        "pnpm build passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 3,
      "passes": false,
      "notes": "Load /convex-best-practices to use useQuery(api.contacts.getByPropertyId) in both the compact bar and full-page views, ordered by sortOrder. Load /tailwind-design-system to implement two presentations: (1) the compact Emergency Contact Bar for Today View (US-011 component) — horizontal scroll of rounded-round avatar icons with role color-coding (primary=owner, secondary=vet, danger=emergency, accent=neighbor) and name below, each wrapping an <a href='tel:[phone]'>; (2) the full-page Contacts tab view — vertical list of bg-bg-raised rounded-lg cards each showing name, role badge, phone as a tappable tel: link (text-secondary font-body font-medium), and optional notes in text-text-muted. Set the Contacts tab as active in the SitterLayout bottom nav when on this route. Use /dev-browser to verify: contacts appear in the bar on Today View, tapping a contact icon in the bar initiates a call (tel: href), the Contacts tab nav item opens the full-page view, notes are visible on the full-page view, role icons are color-coded correctly.",
      "dependsOn": [
        "US-011",
        "US-057"
      ]
    }
  ],
  "metadata": {
    "updatedAt": "2026-02-20T02:55:47.249Z"
  }
}