{
  "name": "Epic 8: Task System & Photo Proof",
  "description": "Task check-off, timestamps, photo proof upload, and sitter attribution.",
  "branchName": "ralph/epic-08-tasks-proof",
  "userStories": [
    {
      "id": "US-060",
      "title": "Task check-off (anonymous)",
      "description": "As a sitter, I want to check off tasks without creating an account so completing my duties is frictionless.",
      "acceptanceCriteria": [
        "Tap checkbox -> task marked complete with spring animation",
        "Timestamp logged: TaskCompletions entry with completedAt",
        "No login/signup required",
        "Completed tasks show checkmark but remain visible (not hidden)",
        "Check-off works offline (queued locally, synced when online)",
        "pnpm typecheck passes",
        "pnpm lint passes",
        "pnpm build passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Load /convex-best-practices to implement completeTask mutation that creates a TaskCompletions record with tripId, taskRef, taskType, completedAt=Date.now(), date=today-string, and sitterName from session storage (empty string if anonymous). Make the mutation callable without authentication (public mutation, no ctx.auth check) since sitters are anonymous. Load /tailwind-design-system to wire the TaskItem component (src/components/ui/TaskItem) checkbox to call useMutation(api.taskCompletions.completeTask) on toggle — the TaskItem already has the spring animation (animate-check-pop, ease-spring) from US-009, so only the mutation hookup is needed. Completed tasks keep their row visible with the checkmark state, striking through the text using line-through text-text-muted. For offline support, implement an optimistic update in the mutation call so the UI updates immediately, and note the Epic 12 IndexedDB queue will handle true offline sync. Use /dev-browser to verify: tapping a task checkbox shows the spring check animation, the task remains visible with a checkmark, reloading the page shows the task still checked, and checking works without any login prompt.",
      "dependsOn": [
        "US-009",
        "US-040",
        "US-046"
      ],
      "completionNotes": "Completed by agent"
    },
    {
      "id": "US-061",
      "title": "Photo proof upload",
      "description": "As a sitter, I want to upload a photo as proof of task completion so the owner has peace of mind.",
      "acceptanceCriteria": [
        "Tasks with proof required show camera button",
        "Tap camera -> opens camera (mobile) or file picker (desktop)",
        "Sitter enters name before upload (pre-filled if owner registered them)",
        "Photo uploaded to Convex file storage, URL saved in TaskCompletions",
        "Upload works offline (queued locally with photo, synced when online)",
        "Owner sees '[name] marked [task] complete at [time]' with photo in activity feed",
        "pnpm typecheck passes",
        "pnpm lint passes",
        "pnpm build passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Load /convex-best-practices to extend TaskCompletions to support proofPhotoUrl (a Convex storageId URL) — update the completeTask mutation to accept an optional storageId, and implement a Convex action uploadProofPhoto that calls generateUploadUrl then updates the TaskCompletion record with the storage URL. Also call logActivityEvent (US-068) inside the action with eventType='proof_uploaded'. Load /frontend-design to build the proof upload interaction on TaskItem: a camera icon button visible on tasks where proofRequired=true, which triggers a name input prompt (bottom sheet or inline) pre-filled from sessionStorage if the sitter name was previously entered, followed by an <input type='file' accept='image/*' capture='environment'>. Show an uploading spinner on the task row during upload. Load /tailwind-design-system to render the proof photo as a 48px thumbnail on the completed task row (rounded-md, object-cover), tappable to full-size. Use /dev-browser to verify: proof-required tasks show the camera icon, tapping prompts for name, selecting a photo shows upload progress, the task completion shows a thumbnail on the row, and the owner's activity feed shows the sitter name + proof photo.",
      "dependsOn": [
        "US-060",
        "US-040"
      ],
      "completionNotes": "Completed by agent"
    },
    {
      "id": "US-062",
      "title": "Owner views task completions and proof",
      "description": "As an owner, I want to see which tasks were completed and view proof photos so I know everything was handled.",
      "acceptanceCriteria": [
        "Activity feed shows task completion events with sitter name and timestamp",
        "Proof photo thumbnail in feed, tappable to full-size viewer",
        "Dashboard shows today's task completion summary (X of Y done)",
        "Can filter activity feed by event type (tasks only, proof only)",
        "pnpm typecheck passes",
        "pnpm lint passes",
        "pnpm build passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Load /convex-best-practices to write getActivityForTrip query with an optional eventType filter parameter ('task_completed', 'proof_uploaded', or undefined for all), using the ActivityLog index on tripId+timestamp. Write getTodayTaskSummary query returning { completed: number, total: number } for the dashboard badge. Load /tailwind-design-system to render using the ActivityFeedItem component (US-018) for each event: sage dot for task_completed, amber dot for proof_uploaded. Proof photo appears as a 64px rounded-md thumbnail below the event text, tappable to open the full-screen viewer from US-039. Render the dashboard summary as a pill badge (bg-secondary-light text-secondary rounded-pill font-body text-sm) showing 'X of Y done'. Add filter chips above the feed (All / Tasks / Proof) using rounded-pill chips that toggle the eventType param. Use /dev-browser to verify: activity feed shows task completion events with sitter name and relative timestamp, proof photos appear as thumbnails and expand on tap, the dashboard shows the accurate X/Y count, and filter chips correctly narrow the feed.",
      "dependsOn": [
        "US-018",
        "US-061"
      ],
      "completionNotes": "Completed by agent"
    }
  ],
  "metadata": {
    "updatedAt": "2026-02-20T06:39:43.710Z"
  }
}